//#include<stdio.h>
//#include<stdlib.h>
//
//int main(void)
//{
//	//指针是什么？是一种数据类型------>装地址的类型
//	int a = 12;
//	int* p = &a;//int类型的指针装int类型的地址
//	//内存模型  指针也是有空间的
//	printf("%p\n",p);
//
//	//指向就是装着它的地址
//	//操作  读，写，取地址
//	printf("%d\n", *p);//---->一个指针指向一个空间，*这个指针就是这个变量本身！
//	//关键点  提醒  *的两种作用   int* p&&*p   一个标示，一个内存操作
//
//	//指针操作是慢的  间接操作
//	//指针的类型决定它操作的字节数
//
//	int* *p1 = &p;//二级指针
//	/**p1 == p;
//	*p == a;
//	**p1 == a;*/
//	**p1 = 11;
//	printf("%d\n", a);
//
//	int b[5] = { 5,4,3,2,1 };
//	int* p2 = b;  //=int *p2=&b[0];   数组名字就是数组首元素的首地址
//	printf("%d\n", *(p2 + 1));
//	b[2] = 111;                      //b[2]=*(p+2)
//	*(b + 2) = 112;
//	printf("%d\n", b[2]);
//
//
//	//指针数组--->指针的数组
//	double s = 34.2;
//	double m = 12.3;
//	double* p10 = &s;
//	double* p20 = &m;
//	double* c[2] = { p10,p20 };
//
//	*c[0] = 333.3;
//	printf("%lf\n", s);
//
//	//数组指针--->数组的指针
//	int d[2] = { 1,2 };
//	int(*p30) [2] = &d;
//	(1)[*p30] = 99;   //(1)[*p30]==(*p30)[1] --->  []下标运算符的深刻理解
//	printf("%d\n", d[1]);
//
//	int t[2] = { 1,3 };
//	int y[2] = { 2,199 };
//	int u[2] = { 5,6 };
//	int* ab[3] = { &t[0],&u[0],&y[0] };
//	printf("%d\n", *(ab[2] + 1));
//
//	system("pause");
//	return 0;
//}